{
    "c2array": true,
    "size": [
        3,
        101,
        1
    ],
    "data": [
        [
            [
                0
            ],
            [
                "Список Шиндлера (1993)"
            ],
            [
                "Побег из Шоушенка (1994)"
            ],
            [
                "Зеленая миля (1999)"
            ],
            [
                "Форрест Гамп (1994)"
            ],
            [
                "Тайна Коко (2017)"
            ],
            [
                "Властелин колец: Возвращение короля"
            ],
            [
                "Интерстеллар (2014)"
            ],
            [
                "Криминальное чтиво (1994)"
            ],
            [
                "Бойцовский клуб"
            ],
            [
                "Властелин колец: Братство Кольца"
            ],
            [
                "Назад в будущее"
            ],
            [
                "Властелин колец: Две крепости"
            ],
            [
                "Иван Васильевич меняет профессию"
            ],
            [
                "Король Лев"
            ],
            [
                "Унесённые призраками"
            ],
            [
                "1+1"
            ],
            [
                "Шрэк"
            ],
            [
                "Темный рыцарь"
            ],
            [
                "ВАЛЛ·И"
            ],
            [
                "Москва слезам не верит"
            ],
            [
                "Достучаться до небес"
            ],
            [
                "Гарри Поттер и узник Азкабана"
            ],
            [
                "Остров проклятых"
            ],
            [
                "Джентльмены удачи"
            ],
            [
                "Операция «Ы»"
            ],
            [
                "Шерлок Холмс и доктор Ватсон"
            ],
            [
                "Пираты Карибского моря"
            ],
            [
                "Девчата"
            ],
            [
                "Гарри Поттер и философский камень"
            ],
            [
                "Гладиатор"
            ],
            [
                "Терминатор 2: Судный день"
            ],
            [
                "...А зори здесь тихие"
            ],
            [
                "Джентльмены"
            ],
            [
                "Они сражались за Родину"
            ],
            [
                "Титаник"
            ],
            [
                "Поймай меня, если сможешь"
            ],
            [
                "Начало"
            ],
            [
                "Ходячий замок"
            ],
            [
                "Большой куш"
            ],
            [
                "В бой идут одни «старики»"
            ],
            [
                "Клаус"
            ],
            [
                "Один дома"
            ],
            [
                "Остров сокровищ"
            ],
            [
                "Гарри Поттер и Тайная комната"
            ],
            [
                "Гарри Поттер и Дары Смерти: Часть II"
            ],
            [
                "Собачье сердце"
            ],
            [
                "Офицеры"
            ],
            [
                "По соображениям совести"
            ],
            [
                "Бриллиантовая рука"
            ],
            [
                "Кавказская пленница"
            ],
            [
                "Зеленая книга"
            ],
            [
                "Карты, деньги, два ствола"
            ],
            [
                "Прислуга"
            ],
            [
                "Джанго освобожденный"
            ],
            [
                "Жизнь прекрасна"
            ],
            [
                "Хатико: Самый верный друг"
            ],
            [
                "Брат"
            ],
            [
                "Служебный роман"
            ],
            [
                "Леон"
            ],
            [
                "Как приручить дракона"
            ],
            [
                "Пираты Карибского моря: Сундук мертвеца"
            ],
            [
                "Назад в будущее 2"
            ],
            [
                "Шрэк 2"
            ],
            [
                "Брат 2"
            ],
            [
                "Пианист"
            ],
            [
                "Крестный отец"
            ],
            [
                "Судьба человека"
            ],
            [
                "Рататуй"
            ],
            [
                "Зверополис"
            ],
            [
                "Пеле: Рождение легенды"
            ],
            [
                "Песнь моря"
            ],
            [
                "Запах женщины"
            ],
            [
                "Укрощение строптивого"
            ],
            [
                "Мужики!.."
            ],
            [
                "Корпорация монстров"
            ],
            [
                "Мулан"
            ],
            [
                "Звёздные войны: Эпизод 3"
            ],
            [
                "Один дома 2"
            ],
            [
                "Тот самый Мюнхгаузен"
            ],
            [
                "Хоббит: Нежданное путешествие"
            ],
            [
                "Иди и смотри"
            ],
            [
                "Матрица"
            ],
            [
                "Одержимость"
            ],
            [
                "Крестный отец 2"
            ],
            [
                "Принцесса Мононоке"
            ],
            [
                "Пираты Карибского моря: На краю света"
            ],
            [
                "Гарри Поттер и Кубок огня"
            ],
            [
                "Мой сосед Тоторо"
            ],
            [
                "Престиж"
            ],
            [
                "Аладдин"
            ],
            [
                "Невероятный мир глазами Энцо"
            ],
            [
                "Летят журавли"
            ],
            [
                "Сокровища Агры"
            ],
            [
                "Отступники"
            ],
            [
                "Мадагаскар"
            ],
            [
                "Любовь и голуби"
            ],
            [
                "Пятый элемент"
            ],
            [
                "Зверопой 2"
            ],
            [
                "Маленький принц"
            ],
            [
                "Твоё имя"
            ]
        ],
        [
            [
                0
            ],
            [
                "9.0"
            ],
            [
                "9.0"
            ],
            [
                9.2
            ],
            [
                "9.0"
            ],
            [
                8.9
            ],
            [
                8.9
            ],
            [
                8.8
            ],
            [
                8.8
            ],
            [
                8.8
            ],
            [
                8.8
            ],
            [
                8.8
            ],
            [
                8.8
            ],
            [
                8.8
            ],
            [
                8.8
            ],
            [
                8.8
            ],
            [
                8.8
            ],
            [
                8.7
            ],
            [
                8.7
            ],
            [
                8.7
            ],
            [
                8.7
            ],
            [
                8.7
            ],
            [
                8.7
            ],
            [
                8.7
            ],
            [
                8.7
            ],
            [
                8.7
            ],
            [
                8.7
            ],
            [
                8.7
            ],
            [
                8.7
            ],
            [
                8.7
            ],
            [
                8.6
            ],
            [
                8.6
            ],
            [
                8.6
            ],
            [
                8.6
            ],
            [
                8.6
            ],
            [
                8.6
            ],
            [
                8.6
            ],
            [
                8.6
            ],
            [
                8.6
            ],
            [
                8.6
            ],
            [
                8.6
            ],
            [
                8.6
            ],
            [
                8.6
            ],
            [
                8.6
            ],
            [
                8.6
            ],
            [
                8.6
            ],
            [
                8.6
            ],
            [
                8.6
            ],
            [
                8.6
            ],
            [
                8.6
            ],
            [
                8.6
            ],
            [
                8.6
            ],
            [
                8.5
            ],
            [
                8.5
            ],
            [
                8.5
            ],
            [
                8.5
            ],
            [
                8.5
            ],
            [
                8.5
            ],
            [
                8.5
            ],
            [
                8.5
            ],
            [
                8.5
            ],
            [
                8.5
            ],
            [
                8.5
            ],
            [
                8.5
            ],
            [
                8.5
            ],
            [
                8.5
            ],
            [
                8.5
            ],
            [
                8.5
            ],
            [
                8.5
            ],
            [
                8.5
            ],
            [
                8.4
            ],
            [
                8.4
            ],
            [
                8.4
            ],
            [
                8.4
            ],
            [
                8.4
            ],
            [
                8.4
            ],
            [
                8.4
            ],
            [
                8.4
            ],
            [
                8.4
            ],
            [
                8.4
            ],
            [
                8.4
            ],
            [
                8.4
            ],
            [
                8.4
            ],
            [
                8.4
            ],
            [
                8.4
            ],
            [
                8.4
            ],
            [
                8.4
            ],
            [
                8.4
            ],
            [
                8.4
            ],
            [
                8.4
            ],
            [
                8.4
            ],
            [
                8.4
            ],
            [
                8.4
            ],
            [
                8.4
            ],
            [
                8.4
            ],
            [
                8.4
            ],
            [
                8.4
            ],
            [
                8.4
            ],
            [
                8.4
            ],
            [
                8.4
            ],
            [
                8.4
            ]
        ],
        [
            [
                0
            ],
            [
                "История немецкого промышленника, спасшего тысячи жизней во время Холокоста. Драма Стивена Спилберга"
            ],
            [
                "Драма о дружбе двух людей, приговоренных к пожизненному заключению"
            ],
            [
                "В тюрьме для смертников появляется заключенный с божественным даром. Мистическая драма по роману Стивена Кинга"
            ],
            [
                "Полувековая история США глазами чудака из Алабамы. Абсолютная классика Роберта Земекиса с Томом Хэнксом"
            ],
            [
                "Мультфильм Pixar про юного музыканта и его путешествие в Страну мертвых"
            ],
            [
                "Повелитель сил тьмы Саурон направляет свою бесчисленную армию под стены Минас-Тирита, крепости Последней Надежды."
            ],
            [
                "Космическая одиссея Кристофера Нолана"
            ],
            [
                "Несколько связанных историй из жизни бандитов. Шедевр Квентина Тарантино, который изменил мировое кино"
            ],
            [
                "Страховой работник разрушает рутину своей благополучной жизни. Культовая драма по книге Чака Паланика"
            ],
            [
                "Первая часть знаменитой трилогии по роману Джона Толкиена"
            ],
            [
                "Безумный ученый и 17-летний оболтус тестируют машину времени, наводя шороху в 1950-х. Классика кинофантастики"
            ],
            [
                "Братство распалось, но Кольцо Всевластья должно быть уничтожено. Фродо и Сэм вынуждены довериться Голлуму, который взялся провести их к вратам Мордора."
            ],
            [
                "Иван Грозный отвечает на телефон, пока его тезка-пенсионер сидит на троне. Советский хит о липовом государе"
            ],
            [
                "У величественного Короля-Льва Муфасы рождается наследник по имени Симба. Уже в детстве любознательный малыш становится жертвой интриг своего завистливого дяди Шрама, мечтающего о власти."
            ],
            [
                "Девочка должна спасти своих родителей в мире духов. Шедевр Хаяо Миядзаки, фаворит анимационных рейтингов мира"
            ],
            [
                "Пострадав в результате несчастного случая, богатый аристократ Филипп нанимает в помощники человека, который менее всего подходит для этой работы, – молодого жителя предместья Дрисса, только что освободившегося из тюрьмы."
            ],
            [
                "Огр-мизантроп спасает принцессу, чтобы вернуть свое болото. Революционная анимация о том, что красота — внутри"
            ],
            [
                "Бэтмен поднимает ставки в войне с криминалом. С помощью лейтенанта Джима Гордона и прокурора Харви Дента он намерен очистить улицы Готэма от преступности."
            ],
            [
                "Робот ВАЛЛ·И из года в год прилежно трудится на опустевшей Земле, очищая нашу планету от гор мусора, которые оставили после себя улетевшие в космос люди. "
            ],
            [
                "Три девушки переезжают в Москву в поисках любви, дружбы и успеха. Советский хит, отмеченный «Оскаром»"
            ],
            [
                "Смертельно больные Мартин и Руди едут к морю на угнанной машине. Роль, сделавшая Тиля Швайгера суперзвездой"
            ],
            [
                "На этот раз они должны раскрыть тайну узника, сбежавшего из зловещей \nтюрьмы Азкабан, чье пребывание на воле создает для Гарри смертельную \nопасность..."
            ],
            [
                "Пристав оказывается заложником клиники для умалишенных. Сложносочиненный детектив с Леонардо ДиКаприо"
            ],
            [
                "Воспитатель детсада внедряется в банду матерых рецидивистов. Евгений Леонов в разошедшейся на цитаты комеди"
            ],
            [
                "Похождения хронически оптимистичного очкарика. Блистательная комедия Леонида Гайдая"
            ],
            [
                "Увлекательные приключения самого известного сыщика всех времен"
            ],
            [
                "Жизнь харизматичного авантюриста, капитана Джека Воробья, полная увлекательных приключений, резко меняется, когда его заклятый враг капитан Барбосса похищает корабль Джека Черную Жемчужину, а затем нападает на Порт Ройал и крадет прекрасную дочь губернатора Элизабет Свонн."
            ],
            [
                "Юная повариха привносит жизни в маленький сибирский поселок. Фильм-эпоха, воспитавший не одно поколение"
            ],
            [
                "Жизнь десятилетнего Гарри Поттера нельзя назвать сладкой: родители умерли, едва ему исполнился год, а от дяди и тёти, взявших сироту на воспитание, достаются лишь тычки да подзатыльники. Но в одиннадцатый день рождения Гарри всё меняется."
            ],
            [
                "Отважный генерал, ставший рабом, мстит империи. Культовая историческая драма Ридли Скотта с пятью «Оскарами»"
            ],
            [
                "Перепрограммированный робот должен защитить маленького Джона Коннора. Самый дорогой блокбастер своего времени"
            ],
            [
                "Зенитчицы совершают подвиг во время Великой Отечественной войны. Номинированная на «Оскар» советская драма"
            ],
            [
                "Наркобарон хочет уйти на покой, но криминальный мир не отпускает. Успешное возвращение Гая Ричи к корням"
            ],
            [
                "Измотанный в сражениях полк должен удержать боевую высоту. Шедевр Сергея Бондарчука о подвиге рядовых солдат"
            ],
            [
                "В первом и последнем плавании шикарного «Титаника» встречаются двое. Пассажир нижней палубы Джек выиграл билет в карты, а богатая наследница Роза отправляется в Америку, чтобы выйти замуж по расчёту."
            ],
            [
                "Виртуозный аферист годами водит за нос ФБР. Хит Стивена Спилберга по реальным событиям с Леонардо ДиКаприо "
            ],
            [
                "Кобб – талантливый вор, лучший из лучших в опасном искусстве извлечения: он крадет ценные секреты из глубин подсознания во время сна, когда человеческий разум наиболее уязвим."
            ],
            [
                "Злая колдунья превращает юную Софи в старушку. Волшебная сказка о силе любви по мотивам книги Дианы Уинн Джонс"
            ],
            [
                "На охоту за крупным алмазом выходят цыгане, евреи и местные головорезы. Криминальная Англия глазами Гая Ричи"
            ],
            [
                "Эта эскадрилья стала «поющей» - так капитан Титаренко подбирал себе новичков. Его «старикам» было не больше двадцати, но «желторотиков», пополнение из летных училищ ускоренного выпуска, в бой все равно, по возможности, не пускали. "
            ],
            [
                "Владелец почтовой империи, чтобы научить ленивого отпрыска по имени Джеспер уму-разуму, отправляет его на крайний север в город Смиренсбург."
            ],
            [
                "Американское семейство отправляется из Чикаго в Европу, но в спешке сборов бестолковые родители забывают дома... одного из своих детей."
            ],
            [
                "Шхуна «Испаньола» бороздит морские просторы в поисках острова, на котором спрятаны легендарные сокровища пиратского капитана Флинта."
            ],
            [
                "Гарри Поттер переходит на второй курс Школы чародейства и волшебства Хогвартс. Эльф Добби предупреждает Гарри об опасности, которая поджидает его там, и просит больше не возвращаться в школу."
            ],
            [
                "В грандиозной последней главе битва между добрыми и злыми силами мира волшебников перерастает во всеобщую войну. Ставки ещё никогда не были так высоки, а поиск убежища — столь сложен."
            ],
            [
                "Профессор Преображенский превращает пса Шарика в человека. Экранизация одноименной повести Михаила Булгакова"
            ],
            [
                "Войны и время не смогли порвать связь между судьбами Алексея и Ивана. Советская драма о дружбе длиною в жизнь "
            ],
            [
                "Медик американской армии времён Второй мировой войны Десмонд Досс, который служил во время битвы за Окинаву, отказывается убивать людей и становится первым идейным уклонистом в американской истории, удостоенным Медали Почёта."
            ],
            [
                "Контрабандисты гоняются за примерным семьянином. Народная комедия с элементами абсурда от Леонида Гайдая "
            ],
            [
                "Отважный Шурик бросается спасать красавицу Нину из лап похитителей. Добродушная советская комедия"
            ],
            [
                "Путешествие итальянца-вышибалы и чернокожего пианиста по Америке 1960-х. «Оскар» за лучший фильм"
            ],
            [
                "Четверо молодых парней накопили каждый по 25 тысяч фунтов, чтобы один из них мог сыграть в карты с опытным шулером и матерым преступником, известным по кличке Гарри-Топор."
            ],
            [
                "Американский Юг, на дворе 1960-е годы. Скитер только-только закончила университет и возвращается домой, в сонный городок Джексон, где никогда ничего не происходит."
            ],
            [
                "Шульц — эксцентричный охотник за головами, который выслеживает и отстреливает самых опасных преступников. Он освобождает раба по имени Джанго, поскольку тот может помочь ему в поисках трёх бандитов."
            ],
            [
                "Во время Второй мировой войны из Италии в концлагерь были отправлены евреи - отец с маленьким сыном. "
            ],
            [
                "Преданный пес каждый день встречает хозяина на вокзале, что бы ни случилось. История, которая потрясла мир"
            ],
            [
                "Дембель Данила Багров защищает слабых в Петербурге 1990-х. Фильм, сделавший Сергея Бодрова народным героем"
            ],
            [
                "Робкий холостяк решает приударить за строгой начальницей. Комедия Эльдара Рязанова, классика советского кино"
            ],
            [
                "Профессиональный убийца Леон неожиданно для себя самого решает помочь 12-летней соседке Матильде, семью которой убили коррумпированные полицейские."
            ],
            [
                "Сын вождя заводит дружбу с драконом — врагом его племени. История о том, что ум и сочувствие куда важнее силы"
            ],
            [
                "Вновь оказавшись в ирреальном мире, лихой капитан Джек Воробей неожиданно узнает, что является должником легендарного капитана «Летучего Голландца» Дэйви Джонса."
            ],
            [
                "Док и Марти решили исправить будущее, но сперва сломали все окончательно. Таким виделся 2015 год из 1989-го "
            ],
            [
                "Счастью новобрачных огров мешают Фея-крестная и ее сын. Номинация на «Оскар» и первое появление Кота в сапогах"
            ],
            [
                "Американцы знакомятся с Данилой Багровым и узнают, в чем сила. Сиквел о герое времени с мощным рок-саундтреком "
            ],
            [
                "Ужасы Холокоста глазами музыканта. Выдающаяся роль Эдриана Броуди и «Золотая пальмовая ветвь» в Каннах"
            ],
            [
                "Криминальная сага, повествующая о нью-йоркской сицилийской мафиозной семье Корлеоне. Фильм охватывает период 1945-1955 годов."
            ],
            [
                "Советский шофер попадает в концлагерь, но не падает духом. Драма Сергея Бондарчука с ним же в главной роли"
            ],
            [
                "Крыс Реми обладает уникальным вкусом. Он готов рисковать собственной жизнью, чтобы посмотреть любимое кулинарное шоу и раздобыть какую-нибудь приправку или просто свежий продукт."
            ],
            [
                "Добро пожаловать в Зверополис – современный город, населенный самыми разными животными, от огромных слонов до крошечных мышек."
            ],
            [
                "Как мальчик из бедной семьи стал великим национальным героем. Мотивирующий байопик о короле футбола"
            ],
            [
                "Бен с сестрой спасают волшебный мир от гибели. Мультфильм Томма Мура, расцветающий на экране красивыми узорами"
            ],
            [
                "Слепой полковник едет кутить в Нью-Йорк под присмотром бедного студента. Заслуженный «Оскар» Аль Пачино"
            ],
            [
                "Красавица Лиза перевоспитывает заядлого холостяка. Шекспировские страсти с Адриано Челентано и Орнеллой Мути"
            ],
            [
                "Шахтер решает вырастить троих детей женщины, которую любил. Пронзительная советская драма о настоящих мужчинах"
            ],
            [
                "Склизкий гад в сливном бачке, мохнатый зверь, похожий на чудовище из «Аленького цветочка», гигантские мокрицы под кроватью — все они существуют на самом деле. Все, что им нужно — пугать детей, потому что из детских криков они получают электричество."
            ],
            [
                "Для великого народа наступили тяжелые времена: на страну напало воинственное племя гуннов. Переодевшись в мужскую одежду, Мулан присоединяется к другим воинам и отправляется в опасный поход к подножию заснеженных гор. "
            ],
            [
                "Идёт третий год Войн клонов. Галактическая Республика, некогда бывшая спокойным и гармоничным государством, превратилась в поле битвы между армиями клонов, возглавляемых канцлером Палпатином, и армадами дроидов, которых ведёт граф Дуку, тёмный лорд ситхов. "
            ],
            [
                "Самый маленький герой Америки устраивает большой переполох в Нью-Йорке! Кевин МакКалистер вернулся! Но теперь он один не дома, а в Нью-Йорке и у него достаточно денег и кредитных карточек, чтобы превратить Большое Яблоко в собственную площадку для игр."
            ],
            [
                "Общество против чудака и пророка. Одна из лучших ролей Олега Янковского в знаковой трагикомедии Марка Захарова"
            ],
            [
                "Бильбо идет в поход с гномами и знакомится с Голлумом. Эпичная экранизация повести Толкина"
            ],
            [
                "Великая Отечественная глазами подростка. Шедевр Элема Климова — один из самых страшных фильмов о войне"
            ],
            [
                "Жизнь Томаса Андерсона разделена на две части: днём он — самый обычный офисный работник, получающий нагоняи от начальства, а ночью превращается в хакера по имени Нео, и нет места в сети, куда он бы не смог проникнуть. Но однажды всё меняется. Томас узнаёт ужасающую правду о реальности."
            ],
            [
                "Юный барабанщик на тернистом пути к величию. Остросюжетная драма Дэмьена Шазелла, отмеченная тремя «Оскарами»"
            ],
            [
                "Для дона Корлеоне и его сына не существует моральных преград на пути к достижению целей. Они превращают мафию, построенную по патриархальным сицилийским законам, в весьма прагматичную, жесткую корпорацию, плавно интегрируя её в большой бизнес Америки."
            ],
            [
                "Заколдованный принц и лесная принцесса борются с древним демоном и его рабами. Аниме-блокбастер Хаяо Миядзаки"
            ],
            [
                "Новые приключения Джека Воробья и его друзей Уилла Тернера и Элизабет Суонн. На этот раз Уиллу и Элизабет придется объединиться с самим Капитаном Барбоссой для того, чтобы отправиться на край света и спасти своего друга — Джека. Ситуация осложняется тем, что Элизабет попадает к сингапурским пиратам…"
            ],
            [
                "Гарри Поттер, Рон и Гермиона возвращаются на четвёртый курс школы чародейства и волшебства Хогвартс. При таинственных обстоятельствах Гарри был отобран в число участников опасного соревнования — Турнира Трёх Волшебников, однако проблема в том, что все его соперники — намного старше и сильнее."
            ],
            [
                "Сестренки знакомятся с обаятельным духом леса. История о вере в чудо, ставшая визитной карточкой студии Ghibli"
            ],
            [
                "Роберт и Альфред - фокусники-иллюзионисты, которые на рубеже XIX и XX веков соперничали друг с другом в Лондоне. С годами их дружеская конкуренция на профессиональной почве перерастает в настоящую войну."
            ],
            [
                "В славном граде Аграба живёт Аладдин, веселый воришка с золотым сердцем. Живёт и не знает, что вскоре его ждёт величайшее приключение в жизни. "
            ],
            [
                "Для собаки по кличке Энцо жизнь – это гонка. Не важно, как ты ее проходишь – за рулем автомобиля или на четырех лапах, все равно тебя ждут крутые виражи, ямы-западни, опасные взлеты и падения. "
            ],
            [
                "Трагедия войны глазами солдатской невесты. Фильм, победивший в Каннах и изменивший советский кинематограф"
            ],
            [
                "Гонки по Темзе, дикарь-убийца и Ирэн Адлер. Четвертая часть сериала про великого сыщика с Василием Ливановым"
            ],
            [
                "Два лучших выпускника полицейской академии оказались по разные стороны баррикады: один из них – агент мафии в рядах правоохранительных органов, другой – «крот», внедрённый в мафию. "
            ],
            [
                "Обитатели нью-йоркского зоопарка оказываются в дикой природе. Трогательная комедия о нерушимой силе дружбы"
            ],
            [
                "Вася пытается заслужить прощения у семьи. Мощнейший актерский состав под руководством Владимира Меньшова"
            ],
            [
                "Последняя надежда человечества — безалаберный нью-йоркский таксист. Самый обаятельный фильм Люка Бессона"
            ],
            [
                "Только рокер-отшельник может спасти группу Бастера Муна от провала. Сиквел мюзикла про животных-музыкантов"
            ],
            [
                "Мудрый старик учит маленькую девочку мечтать. Свежее прочтение великой книги от режиссера «Кунг-фу Панды»"
            ],
            [
                "Токийский парень Таки и провинциальная девушка Мицуха обнаруживают, что между ними существует странная связь. Во сне они меняются телами и проживают жизни друг друга. "
            ]
        ]
    ]
}